DataProcessors/РегистрацияСводныхСправок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РегистрацияСводныхСправок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокПродажи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументПродажи</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СводнаяСправка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокВозвраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументПродажи</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументВозврата</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СводнаяСправка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорректировочнаяСводнаяСправка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/НастройкиУчетаНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаНДС</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрименяетсяОсвобождениеОтУплатыНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СложныйУчетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаздельныйУчетНДСДо2014Года</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаздельныйУчетНДСНаСчете19</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОперации0</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлассифицироватьНоменклатуруПоОперациям0</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УпрощенныйУчетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьНДСПоОтгрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьНДСПриПередачеНедвижимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокРегистрацииСчетовФактурНаАванс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокРегистрацииСчетовФактурНаАванс</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьДолюВычета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезопаснаяДоляВычета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалогообложенияПриУСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтавокНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаздельныйУчетНДСБезВычетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьРегистрацииСводныхСправок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоступныеПериодыОтчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/РегистрацияСводныхСправок/Forms/Форма/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

&НаКлиенте
Перем УИДЗамера;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	
	Объект.Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	
	ЗаполнитьРеквизитыИзПараметровФормы(ЭтотОбъект);
		
	ДанныеПериодичностиРегистрации = ПолучитьПериодичностьРегистрацииСводныхСправок(Объект.Организация,
		Объект.КонецПериода);
		
	ПериодичностьРегистрации      = ДанныеПериодичностиРегистрации.ПериодичностьРегистрации;
	ПериодичностьРегистрацииТекст = ДанныеПериодичностиРегистрации.ПериодичностьРегистрацииТекст;
	
	УправлениеФормой(ЭтотОбъект);
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ИзменениеУчетнойПолитики"
		ИЛИ ИмяСобытия = "Запись_НастройкиУчетаНДС" Тогда
		
		Если Параметр = Объект.Организация
			ИЛИ Параметр = ОбщегоНазначенияБПВызовСервераПовтИсп.ГоловнаяОрганизация(Объект.Организация)
			ИЛИ ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("Организация") Тогда
		 
			ДанныеПериодичностиРегистрации = ПолучитьПериодичностьРегистрацииСводныхСправок(Объект.Организация,
				Объект.КонецПериода);
			
			ПериодичностьРегистрации      = ДанныеПериодичностиРегистрации.ПериодичностьРегистрации;
			ПериодичностьРегистрацииТекст = ДанныеПериодичностиРегистрации.ПериодичностьРегистрацииТекст;
			
			УправлениеФормой(ЭтотОбъект);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	Если Объект.НачалоПериода > Объект.КонецПериода Тогда
		Объект.КонецПериода = Объект.НачалоПериода;
		
		ПриИзмененииОрганизацииИПериода();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	Если Объект.КонецПериода < Объект.НачалоПериода Тогда
		Объект.НачалоПериода = Объект.КонецПериода;
	КонецЕсли;
	
	ПриИзмененииОрганизацииИПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ПриИзмененииОрганизацииИПериода();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокПродажи

&НаКлиенте
Процедура СписокПродажиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокВозвраты

&НаКлиенте
Процедура СписокВозвратыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьСписокСводныхСправок(Команда)

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ВидСчетаФактуры", ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыВыставленного.СводнаяСправка"));
	
	ОткрытьСписокСчетовФактурСОтбором(ПараметрыОтбора);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокКорректировочныхСводныхСправок(Команда)

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ВидСчетаФактуры", ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыВыставленного.КорректировочнаяСправка"));
	
	ОткрытьСписокСчетовФактурСОтбором(ПараметрыОтбора);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ПараметрыВыбора = Новый Структура("НачалоПериода,КонецПериода", Объект.НачалоПериода, Объект.КонецПериода);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыВыбора, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТабличныеЧасти(Команда)

	Если Объект.СписокПродажи.Количество() > 0 ИЛИ Объект.СписокПродажи.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru='Перед заполнением табличная часть будет очищена. Заполнить?'");
		Оповещение = Новый ОписаниеОповещения("ВопросОчищениеТабличнойЧастиЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, "Регистрация сводных справок");
	Иначе
		ЗаполнитьСводныеСправки();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиУчетаНДС(Команда)
	
	Если НЕ ЗначениеЗаполнено(ПериодичностьРегистрации) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;

	Если ЗначениеЗаполнено(Объект.Организация)
		И ЗначениеЗаполнено(Объект.КонецПериода) Тогда
		КлючЗаписи = ПолучитьДанныеУчетнойПолитики(Объект.Организация, Объект.КонецПериода);
		Если КлючЗаписи <> Неопределено Тогда
			ПараметрыОткрытия = Новый Структура("Ключ, ПараметрыОткрытия",
				КлючЗаписи,
				Новый Структура("АктивныйЭлемент", "ПорядокРегистрацииСводныхСправок"));
			ОткрытьФорму("РегистрСведений.НастройкиУчетаНДС.ФормаЗаписи", ПараметрыОткрытия, ЭтотОбъект, "");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьФормированиеДокументов(Команда)

	Если НЕ ПроверитьЗаполнение() ИЛИ Объект.СписокПродажи.Количество() = 0 И Объект.СписокВозвраты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ПараметрыОбработки =
		Новый Структура("УстановитьПометкиУдаления,ОчиститьСписокНеиспользуемыхСчетовФактур,
		|Организация, НачалоПериода", Ложь, Ложь, Объект.Организация, Объект.НачалоПериода);
	
	ПараметрЗаполненияДокумента = Ложь;
	ИнициализацияКомандДокументаНаКлиенте(ПараметрыОбработки);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект, РезультатВыбора, "НачалоПериода,КонецПериода");
	
	ПриИзмененииОрганизацииИПериода();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	КоличествоСтрокСпискаПродажи  = Форма.Объект.СписокПродажи.Количество();
	КоличествоСтрокСпискаВозвраты = Форма.Объект.СписокВозвраты.Количество();
	
	Элементы.Выполнить.Доступность = КоличествоСтрокСпискаПродажи <> 0 ИЛИ КоличествоСтрокСпискаВозвраты <> 0;
	
	Если ЗначениеЗаполнено(Форма.Объект.Организация)
		И ЗначениеЗаполнено(Форма.ПериодичностьРегистрацииТекст) Тогда
		Элементы.НадписьПериодичностьФормирования.Видимость = Истина;
		Элементы.ОткрытьФормуНастройкиУчетаНДС.Видимость    = Истина;
		Элементы.ОткрытьФормуНастройкиУчетаНДС.Заголовок    = Форма.ПериодичностьРегистрацииТекст;
		
	Иначе
		Элементы.НадписьПериодичностьФормирования.Видимость = Ложь;
		Элементы.ОткрытьФормуНастройкиУчетаНДС.Видимость    = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)

	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);

КонецФункции

&НаКлиенте
Процедура ПоказатьИнформациюОЗавершенииРегистрации()
	
	Если ПараметрЗаполненияДокумента Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru='Регистрация сводных справок выполнена.'");
	ПоказатьПредупреждение(, ТекстСообщения);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеУчетнойПолитики(Организация, Период)

	Выборка = РегистрыСведений.НастройкиУчетаНДС.Выбрать(, Период,
		Новый Структура("Организация", Организация), "Убыв");
		
	Если Выборка.Следующий() Тогда
		Отбор = Новый Структура("Период, Организация", Выборка.Период, Выборка.Организация);
		Возврат РегистрыСведений.НастройкиУчетаНДС.СоздатьКлючЗаписи(Отбор)
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ЗаполнитьСводныеСправки()

	ПараметрЗаполненияДокумента = Истина;
	ИнициализацияКомандДокументаНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура ИнициализацияКомандДокументаНаКлиенте(ПараметрыОбработки = Неопределено)

	ОчиститьСообщения();

	// СтандартныеПодсистемы.ОценкаПроизводительности
	УИДЗамера = ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Ложь, "СозданиеСводнойСправкиЗаполнение");
	// СтандартныеПодсистемы.ОценкаПроизводительности
	
	ИБФайловая = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиента().ИнформационнаяБазаФайловая;
	Если ПараметрЗаполненияДокумента Тогда
		Результат = ЗаполнитьСводныеСправкиНаСервере(ИБФайловая);
		
	Иначе
		Результат = СоздатьСводныеСправкиНаСервере(ПараметрыОбработки, ИБФайловая);
		
	КонецЕсли;

	Если НЕ Результат.ЗаданиеВыполнено Тогда
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтотОбъект, ИдентификаторЗадания);

		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
		АдресХранилища       = Результат.АдресХранилища;
		
	Иначе
		ПоказатьИнформациюОЗавершенииРегистрации();
		ОценкаПроизводительностиКлиент.ЗавершитьЗамерВремени(УИДЗамера);
	КонецЕсли;
	
	Если Не ПараметрЗаполненияДокумента Тогда
		Оповестить("СостояниеРегламентнойОперации", 
			?(Результат.ЗаданиеВыполнено, ПредопределенноеЗначение("Перечисление.ВидыСостоянийРегламентныхОпераций.Выполнено"), 
				ПредопределенноеЗначение("Перечисление.ВидыСостоянийРегламентныхОпераций.НеВыполнено")));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСводныеСправкиНаСервере(ИБФайловая)

	Объект.СписокПродажи.Очистить();
	Объект.СписокВозвраты.Очистить();
	
	СтруктураПараметров = УчетНДСБП.ПараметрыЗаполненияРегистрацииСчетовФактур();
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, Объект);
	
	Если ИБФайловая Тогда
		ЭтотОбъект.АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, ЭтотОбъект.УникальныйИдентификатор);
		Обработки.РегистрацияСводныхСправок.ПодготовитьДанныеДляЗаполнения(СтруктураПараметров, АдресХранилища);
		Результат = Новый Структура("ЗаданиеВыполнено", Истина);
	Иначе
		НаименованиеФоновогоЗадания = НСтр("ru = 'Заполнение таблицы ""Регистрация сводных справок""'");
		Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
			УникальныйИдентификатор,
			"Обработки.РегистрацияСводныхСправок.ПодготовитьДанныеДляЗаполнения",
			СтруктураПараметров,
			НаименованиеФоновогоЗадания);
	
			АдресХранилища = Результат.АдресХранилища;
	КонецЕсли;
		
	Если Результат.ЗаданиеВыполнено Тогда
		ЗагрузитьПодготовленныеДанные();
	КонецЕсли;

	Возврат Результат;

КонецФункции

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()
	
	СтруктураДанных = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если ТипЗнч(СтруктураДанных) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураДанных.Свойство("СписокПродажи") Тогда
		Объект.СписокПродажи.Загрузить(СтруктураДанных.СписокПродажи);
	КонецЕсли;
	
	Если СтруктураДанных.Свойство("СписокВозвраты") Тогда
		Объект.СписокВозвраты.Загрузить(СтруктураДанных.СписокВозвраты);
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция СоздатьСводныеСправкиНаСервере(ПараметрыОбработки, ИБФайловая)

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Организация",                    Объект.Организация);
	СтруктураПараметров.Вставить("НачалоПериода",                  Объект.НачалоПериода);
	СтруктураПараметров.Вставить("КонецПериода",                   Объект.КонецПериода);
	СтруктураПараметров.Вставить("ПериодичностьРегистрации",       ПериодичностьРегистрации);
	СтруктураПараметров.Вставить("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);

	ТаблицыДокументов = Новый Структура;
	ТаблицыДокументов.Вставить("СписокПродажи",  Объект.СписокПродажи.Выгрузить());
	ТаблицыДокументов.Вставить("СписокВозвраты", Объект.СписокВозвраты.Выгрузить());
			
	СтруктураПараметров.Вставить("ТаблицыДокументов", ТаблицыДокументов);

	Если ИБФайловая Тогда
		ЭтотОбъект.АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, ЭтотОбъект.УникальныйИдентификатор);
		Обработки.РегистрацияСводныхСправок.СформироватьСводныеСправки(СтруктураПараметров, ЭтотОбъект.АдресХранилища);
		Результат = Новый Структура("ЗаданиеВыполнено", Истина);
		
	Иначе
		НаименованиеФоновогоЗадания = НСтр("ru = 'Формирование сводных справок в ""Регистрация сводных справок""'");
		Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
			УникальныйИдентификатор,
			"Обработки.РегистрацияСводныхСправок.СформироватьСводныеСправки",
			СтруктураПараметров,
			НаименованиеФоновогоЗадания);
		АдресХранилища = Результат.АдресХранилища;
		
	КонецЕсли;

	Если Результат.ЗаданиеВыполнено Тогда
		ЗагрузитьПодготовленныеДанные();
		
	КонецЕсли;

	Возврат Результат;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПериодичностьРегистрацииСводныхСправок(Организация, Дата)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ПериодичностьРегистрации",      Перечисления.ДоступныеПериодыОтчета.ПустаяСсылка());
	СтруктураВозврата.Вставить("ПериодичностьРегистрацииТекст", "");
	
	Если НЕ ЗначениеЗаполнено(Организация) ИЛИ НЕ ЗначениеЗаполнено(Дата) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли; 
	
	ПорядокРегистрацииПоУчетнойПолитике = УчетнаяПолитика.ПериодичностьРегистрацииСводныхСправок(Организация, Дата);
	
	Если ПорядокРегистрацииПоУчетнойПолитике = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц") Тогда	
		ПериодичностьРегистрацииТекст = "Месяц";
	Иначе
		ПериодичностьРегистрацииТекст = "Квартал";
	КонецЕсли;	

	СтруктураВозврата.Вставить("ПериодичностьРегистрации",      ПорядокРегистрацииПоУчетнойПолитике);
	СтруктураВозврата.Вставить("ПериодичностьРегистрацииТекст", ПериодичностьРегистрацииТекст);
	
	Возврат СтруктураВозврата;

КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьРеквизитыИзПараметровФормы(Форма)
	
	ПараметрыЗаполненияФормы = Неопределено;
	
	Объект = Форма.Объект;
	
	Если Форма.Параметры.Свойство("ПараметрыЗаполненияФормы", ПараметрыЗаполненияФормы) Тогда
		ЗаполнитьЗначенияСвойств(Объект, ПараметрыЗаполненияФормы);
	
	Иначе
		Объект.НачалоПериода = ОбщегоНазначения.ТекущаяДатаПользователя();
		Объект.КонецПериода  = ОбщегоНазначения.ТекущаяДатаПользователя();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииОрганизацииИПериода()

	ДанныеПериодичностиРегистрации = ПолучитьПериодичностьРегистрацииСводныхСправок(Объект.Организация,
		Объект.КонецПериода);

	ПериодичностьРегистрации      = ДанныеПериодичностиРегистрации.ПериодичностьРегистрации;
	ПериодичностьРегистрацииТекст = ДанныеПериодичностиРегистрации.ПериодичностьРегистрацииТекст;
	
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	ПараметрыОформления = Новый Структура;
	ПараметрыОформления.Вставить("ИмяПоля",               "СписокПродажиКонтрагент");
	ПараметрыОформления.Вставить("ИмяПоляЭлементаОтбора", "Объект.СписокПродажи.ЭтоОтчетКомиссионера");
	
	УстановитьОформлениеПоляКонтрагентВСписке(ПараметрыОформления);
	
	ПараметрыОформления = Новый Структура;
	ПараметрыОформления.Вставить("ИмяПоля",               "СписокВозвратыКонтрагент");
	ПараметрыОформления.Вставить("ИмяПоляЭлементаОтбора", "Объект.СписокВозвраты.ЭтоОтчетКомиссионера");
	
	УстановитьОформлениеПоляКонтрагентВСписке(ПараметрыОформления);

КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеПоляКонтрагентВСписке(ПараметрыОформления)
	
	ИмяПоля               = ПараметрыОформления.ИмяПоля;
	ИмяПоляЭлементаОтбора = ПараметрыОформления.ИмяПоляЭлементаОтбора;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУсловногоОформления.Поля, ИмяПоля);

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУсловногоОформления.Отбор,
		ИмяПоляЭлементаОтбора, ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Розничный покупатель>'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросОчищениеТабличнойЧастиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьСводныеСправки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокСчетовФактурСОтбором(Параметры)

	ПараметрыОтбор = Новый Структура;
	ПараметрыОтбор.Вставить("Организация",     Объект.Организация);
	ПараметрыОтбор.Вставить("ВидСчетаФактуры", Параметры.ВидСчетаФактуры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПараметрыОтбораСписка", ПараметрыОтбор);
	
	Если Объект.НачалоПериода <> '00010101' ИЛИ Объект.КонецПериода <> '00010101' Тогда
		Если Объект.НачалоПериода = '00010101' Тогда
			ПараметрыФормы.Вставить("ДатаМеньшеИлиРавно", КонецДня(Объект.КонецПериода));
		ИначеЕсли Объект.КонецПериода = '00010101' Тогда
			ПараметрыФормы.Вставить("ДатаБольшеИлиРавно", Объект.НачалоПериода);
		Иначе
			// ИнтервалВключаяГраницы с НачалоПериода по КонецПериода
			ПараметрыФормы.Вставить("ДатаБольшеИлиРавно", Объект.НачалоПериода);
			ПараметрыФормы.Вставить("ДатаМеньшеИлиРавно", КонецДня(Объект.КонецПериода));
		КонецЕсли;
	КонецЕсли;
	
	ОткрытьФорму("Документ.СчетФактураВыданный.ФормаСписка", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()

	Попытка
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда
			ЗагрузитьПодготовленныеДанные();
			ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			ПоказатьИнформациюОЗавершенииРегистрации();
			ОценкаПроизводительностиКлиент.ЗавершитьЗамерВремени(УИДЗамера);
			
		Иначе
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания",
				ПараметрыОбработчикаОжидания.ТекущийИнтервал, Истина);
				
		КонецЕсли;
			
	Исключение
		УИДЗамера = Неопределено;
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;

КонецПроцедуры

#КонецОбласти
